In [1]:
from sqlalchemy import MetaData, Table, create_engine, select, and_, or_, not_, text
from sqlalchemy.sql import func, distinct, exists
from sqlalchemy import union, union_all

engine = create_engine('sqlite+pysqlite:////Users/vladislavvorosilov/Desktop/Python_SQL/Python_SQL_PI_2021_22_s2/Data/Students.db')
metadata_obj = MetaData()
metadata_obj.reflect(bind=engine) 
exam_marks=Table("exam_marks", metadata_obj, autoload=True, autoload_with="engine")
lecturer=Table("lecturer", metadata_obj, autoload=True, autoload_with="engine")
student=Table("student", metadata_obj, autoload=True, autoload_with="engine")
subj_lect=Table("subj_lect", metadata_obj, autoload=True, autoload_with="engine")
subject=Table("subject", metadata_obj, autoload=True, autoload_with="engine")
university=Table("university", metadata_obj, autolad=True, autolad_with="engine")
conn=engine.connect()

## 1. Создайте объединение двух запросов, которые выдают значения полей *univ_name*, *city*, *rating* для всех университетов. Те из них, у которых рейтинг равен или выше 300, должны иметь комментарий ‘высокий’, все остальные — ‘низкий’.

In [12]:
s1 = select(university.c.univ_name, university.c.city,text("'Высокий' AS Category"), university.c.rating)
s1 = s1.where(university.c.rating >= 300)

s2 = select(university.c.univ_name, university.c.city,text("'Низкий' AS Category"), university.c.rating)
s2 = s2.where(university.c.rating < 300)

stmt = union(s1, s2)
print(stmt)
result = conn.execute(stmt).fetchall()
print(len(result))
result[:10]

SELECT university.univ_name, university.city, 'Высокий' AS Category, university.rating
FROM university
WHERE university.rating >= :rating_1 UNION SELECT university.univ_name, university.city, 'Низкий' AS Category, university.rating
FROM university
WHERE university.rating < :rating_2
12

[('БГУ', 'Белгород', 'Высокий', 326),
 ('ВГМА', 'Воронеж', 'Высокий', 327),
 ('ВГУ', 'Воронеж', 'Низкий', 296),
 ('МГТУ им. Баумана', 'Москва', 'Высокий', 372),
 ('МГУ', 'Москва', 'Высокий', 606),
 ('МФТИ', 'Москва', 'Высокий', 500),
 ('НГУ', 'Новосибирск', 'Высокий', 345),
 ('РГУ', 'Ростов', 'Высокий', 416),
 ('ТГУ', 'Томск', 'Высокий', 368),
 ('УЛГУ', 'Ульяновск', 'Низкий', 231)]

## 2. Напишите команду, которая выдает список фамилий студентов с комментарием: 'успевает' у студентов, имеющих все положительные оценки; 'не успевает' для сдававших экзамены, но имеющих хотя бы одну неудовлетворительную оценку; 'не сдавал' — для всех остальных. В выводимом результате фамилии студентов упорядочите по алфавиту.

#### Я переделал запрос так, чтобы он выводил ожидаемое количество студентов: 90

In [24]:
s1 = select(student.c.student_id, student.c.surname, text("'Успевает' AS Rate"), func.min(exam_marks.c.mark).label("Worst_rate"))
s1 = s1.join_from(student, exam_marks, exam_marks.c.student_id == student.c.student_id)
s1 = s1.group_by(student.c.student_id)
s1 = s1.having(text("Worst_rate >3"))

s2 = select(student.c.student_id,student.c.surname, text("'Не успевает'"), func.min(exam_marks.c.mark).label("Worst_rate"))
s2 = s2.join_from(student, exam_marks, exam_marks.c.student_id == student.c.student_id)
s2 = s2.group_by(student.c.student_id)
s2 = s2.having(text("Worst_rate <= 3"))

s3 = select(student.c.student_id,student.c.surname, text("'Не сдавал'"), text("'Не сдавал'"))
s3 = s3.join_from(student, exam_marks, exam_marks.c.student_id == student.c.student_id, isouter=True)
s3 = s3.where(exam_marks.c.exam_id == None)

stmt = union(s1, s2, s3)
print(stmt)
result = conn.execute(stmt).fetchall()
print(len(result))
result[:10]

SELECT student.student_id, student.surname, 'Успевает' AS Rate, min(exam_marks.mark) AS "Worst_rate"
FROM student JOIN exam_marks ON exam_marks.student_id = student.student_id GROUP BY student.student_id
HAVING Worst_rate >3 UNION SELECT student.student_id, student.surname, 'Не успевает', min(exam_marks.mark) AS "Worst_rate"
FROM student JOIN exam_marks ON exam_marks.student_id = student.student_id GROUP BY student.student_id
HAVING Worst_rate <= 3 UNION SELECT student.student_id, student.surname, 'Не сдавал', 'Не сдавал'
FROM student LEFT OUTER JOIN exam_marks ON exam_marks.student_id = student.student_id
WHERE exam_marks.exam_id IS NULL
90

[(1, 'Иванов', 'Не успевает', 1),
 (3, 'Петров', 'Не сдавал', 'Не сдавал'),
 (6, 'Сидоров', 'Успевает', 4),
 (10, 'Кузнецов', 'Успевает', 5),
 (12, 'Зайцева', 'Не успевает', 2),
 (15, 'Ордуханян', 'Не успевает', 2),
 (32, 'Котов', 'Успевает', 4),
 (55, 'Белкин', 'Успевает', 5),
 (56, 'Дуб', 'Не сдавал', 'Не сдавал'),
 (57, 'Кудряшова', 'Не сдавал', 'Не сдавал')]

## 3. Выведите объединенный список студентов и преподавателей, живущих в Москве, с соответствующими комментариями 'студент' или 'преподаватель'.

In [44]:
s1 = select(student.c.surname, student.c.name, text("'Студент' AS Category"))
s1 = s1.where(student.c.city == "Москва")

s2 = select(lecturer.c.surname, lecturer.c.name,text("'Преподаватель' AS Category"))
s2 = s2.where(lecturer.c.city == "Москва")

stmt = union(s1, s2)
print(stmt)
result = conn.execute(stmt).fetchall()
print(len(result))
result[:10]

SELECT student.surname, student.name, 'Студент' AS Category
FROM student
WHERE student.city = :city_1 UNION SELECT lecturer.surname, lecturer.name, 'Преподаватель' AS Category
FROM lecturer
WHERE lecturer.city = :city_2
5

[('Баранов', 'Александр', 'Студент'),
 ('Лагутин', 'Павел', 'Преподаватель'),
 ('Миронова', 'Федор', 'Студент'),
 ('Сидоров', 'Вадим', 'Студент'),
 ('Струков', 'Николай', 'Преподаватель')]

## 4. Выведите объединенный список студентов и преподавателей ВГУ с соответствующими комментариями 'студент' или 'преподаватель'.

In [83]:
s1 = select(text("'Студент'"), student.c.surname, student.c.name, student.c.city)
s1 = s1.select_from(student)
s1 = s1.join(university)
s1 = s1.where(university.c.univ_name == "ВГУ")

s2 = select(text("'Преподаватель'"), lecturer.c.surname, lecturer.c.name, lecturer.c.city)
s2 = s2.select_from(lecturer)
s2 = s2.join(university)
s2 = s2.where(university.c.univ_name == "ВГУ")

stmt = union(s1, s2)

print(stmt)
result = conn.execute(stmt).fetchall()
print(len(result))
result[:10]

SELECT 'Студент', student.surname, student.name, student.city
FROM student JOIN university ON university.univ_id = student.univ_id
WHERE university.univ_name = :univ_name_1 UNION SELECT 'Преподаватель', lecturer.surname, lecturer.name, lecturer.city
FROM lecturer JOIN university ON university.univ_id = lecturer.univ_id
WHERE university.univ_name = :univ_name_2
24

[('Преподаватель', 'Алексеев', 'Елисей', 'Мценск'),
 ('Преподаватель', 'Зайцева', 'Юлия', 'Белгород'),
 ('Преподаватель', 'Зыкова', 'Оксана', 'Калач'),
 ('Преподаватель', 'Колесников', 'Борис', 'Воронеж'),
 ('Преподаватель', 'Максимова', 'Иванна', 'Сковородино'),
 ('Преподаватель', 'Николаев', 'Виктор', 'Воронеж'),
 ('Преподаватель', 'Никонов', 'Иван', 'Воронеж'),
 ('Преподаватель', 'Сорокин', 'Андрей', 'Орел'),
 ('Студент', 'Агафонов', 'Василий', 'Грозный'),
 ('Студент', 'Аксенов', 'Валерий', 'Мурманск')]

## 5. Для каждого города выведите названия университетов с минимальным и максимальным для данного города рейтингом. Пометьте строки списка словами ‘min’ и ‘max’, поместив их в дополнительном столбце. Резулььтат должен содержать название города, название университета, рейтинг. Упорядочите результат по городу.

In [65]:
u1 = university.alias("u1")
u2 = university.alias("u2")

subq1 = select(func.max(u2.c.rating))
subq1 = subq1.group_by(u2.c.city)
subq1 = subq1.having(u2.c.city == u1.c.city).scalar_subquery()


subq2 = select(func.min(u2.c.rating))
subq2 = subq2.group_by(u2.c.city)
subq2 = subq2.having(u2.c.city == u1.c.city).scalar_subquery()


s1 = select(u1.c.city, u1.c.univ_name, u1.c.rating, text("'Максимальный' AS Category"))
s1 = s1.where( u1.c.rating == subq1)

s2 = select(u1.c.city, u1.c.univ_name, u1.c.rating, text("'Минимальный' AS Category"))
s2 = s2.where( u1.c.rating == subq2)

stmt = union(s1, s2)
print(stmt)
result = conn.execute(stmt).fetchall()
print(len(result))
result

SELECT u1.city, u1.univ_name, u1.rating, 'Максимальный' AS Category
FROM university AS u1
WHERE u1.rating = (SELECT max(u2.rating) AS max_1
FROM university AS u2 GROUP BY u2.city
HAVING u2.city = u1.city) UNION SELECT u1.city, u1.univ_name, u1.rating, 'Минимальный' AS Category
FROM university AS u1
WHERE u1.rating = (SELECT min(u2.rating) AS min_1
FROM university AS u2 GROUP BY u2.city
HAVING u2.city = u1.city)
16

[('Белгород', 'БГУ', 326, 'Максимальный'),
 ('Белгород', 'БГУ', 326, 'Минимальный'),
 ('Воронеж', 'ВГМА', 327, 'Максимальный'),
 ('Воронеж', 'ВГУ', 296, 'Минимальный'),
 ('Москва', 'МГУ', 606, 'Максимальный'),
 ('Москва', 'ФинУ', 330, 'Минимальный'),
 ('Новосибирск', 'НГУ', 345, 'Максимальный'),
 ('Новосибирск', 'НГУ', 345, 'Минимальный'),
 ('Ростов', 'РГУ', 416, 'Максимальный'),
 ('Ростов', 'РГУ', 416, 'Минимальный'),
 ('Санкт-Петербург', 'ФГБОУ "Политех"', 304, 'Максимальный'),
 ('Санкт-Петербург', 'ФГБОУ "Политех"', 304, 'Минимальный'),
 ('Томск', 'ТГУ', 368, 'Максимальный'),
 ('Томск', 'ТГУ', 368, 'Минимальный'),
 ('Ульяновск', 'УЛГУ', 231, 'Максимальный'),
 ('Ульяновск', 'УЛГУ', 231, 'Минимальный')]

## 6. Для каждого курса выведите фамилии студентов, получающих минимальные и максимальные на их курсе стипендии. Пометьте строки списка словами ‘min’ и ‘max’, поместив их в дополнительном столбце.

In [77]:
s1 = student.alias("s1")
s2 = student.alias("s2")

subq1 = select(func.max(s2.c.stipend))
subq1 = subq1.group_by(s2.c.kurs)
subq1 = subq1.having(s2.c.kurs == s1.c.kurs).scalar_subquery()


subq2 = select(func.min(s2.c.stipend))
subq2 = subq2.group_by(s2.c.kurs)
subq2 = subq2.having(s2.c.kurs == s1.c.kurs).scalar_subquery()


stmt1 = select(s1.c.student_id, s1.c.surname, s1.c.name, s1.c.stipend, s1.c.kurs,  text("'Максимальная' AS Category"))
stmt1 = stmt1.where( s1.c.stipend == subq1)

stmt2 = select(s1.c.student_id, s1.c.surname, s1.c.name, s1.c.stipend, s1.c.kurs, text("'Минимальная' AS Category"))
stmt2 = stmt2.where( s1.c.stipend == subq2)

stmt = union(stmt1, stmt2).order_by(s1.c.student_id)
print(stmt)
result = conn.execute(stmt).fetchall()
print(len(result))
result

SELECT s1.student_id, s1.surname, s1.name, s1.stipend, s1.kurs, 'Максимальная' AS Category
FROM student AS s1
WHERE s1.stipend = (SELECT max(s2.stipend) AS max_1
FROM student AS s2 GROUP BY s2.kurs
HAVING s2.kurs = s1.kurs) UNION SELECT s1.student_id, s1.surname, s1.name, s1.stipend, s1.kurs, 'Минимальная' AS Category
FROM student AS s1
WHERE s1.stipend = (SELECT min(s2.stipend) AS min_1
FROM student AS s2 GROUP BY s2.kurs
HAVING s2.kurs = s1.kurs) ORDER BY student_id
39

[(10, 'Кузнецов', 'Борис', 0, 2, 'Минимальная'),
 (12, 'Зайцева', 'Ольга', 250, 2, 'Максимальная'),
 (55, 'Белкин', 'Вадим', 250, 5, 'Максимальная'),
 (57, 'Кудряшова', 'Вера', 100, 5, 'Минимальная'),
 (58, 'Журавлева', 'Вера', 0, 4, 'Минимальная'),
 (60, 'Рожкова', 'Пелагея', 0, 3, 'Минимальная'),
 (62, 'Семенова', 'Вероника', 0, 3, 'Минимальная'),
 (64, 'Жук', 'Оксана', 250, 1, 'Максимальная'),
 (65, 'Сергеева', 'Фёкла', 100, 5, 'Минимальная'),
 (66, 'Некрасова', 'Вероника', 250, 2, 'Максимальная'),
 (68, 'Казакова', 'Ольга', 250, 4, 'Максимальная'),
 (69, 'Шубина', 'Елена', 0, 2, 'Минимальная'),
 (72, 'Пономарева', 'Алина', 250, 2, 'Максимальная'),
 (73, 'Одинцова', 'Лидия', 100, 5, 'Минимальная'),
 (74, 'Гуляева', 'Рукижат', 0, 3, 'Минимальная'),
 (75, 'Игнатова', 'Зинаида', 100, 5, 'Минимальная'),
 (76, 'Мельникова', 'Дарья', 100, 5, 'Минимальная'),
 (79, 'Афанасьева', 'Анжелика', 0, 2, 'Минимальная'),
 (90, 'Костина', 'Кира', 0, 4, 'Минимальная'),
 (91, 'Блохина', 'Ираида', 250, 3, 'Максимальная'),
 (92, 'Мельникова', 'Светлана', 250, 4, 'Максимальная'),
 (94, 'Васильева', 'Оксана', 0, 1, 'Минимальная'),
 (103, 'Трофимов', 'Владислав', 250, 5, 'Максимальная'),
 (104, 'Бирюков', 'Герасим', 0, 4, 'Минимальная'),
 (107, 'Морозов', 'Кирилл', 250, 2, 'Максимальная'),
 (110, 'Суханов', 'Константин', 250, 3, 'Максимальная'),
 (114, 'Панов', 'Арсений', 250, 1, 'Максимальная'),
 (121, 'Воронова', 'Антонина', 0, 4, 'Минимальная'),
 (124, 'Юдин', 'Савва', 0, 2, 'Минимальная'),
 (126, 'Жуков', 'Пров', 0, 3, 'Минимальная'),
 (130, 'Кудряшов', 'Роман', 250, 4, 'Максимальная'),
 (135, 'Комаров', 'Ипат', 0, 1, 'Минимальная'),
 (141, 'Ершов', 'Митрофан', 250, 5, 'Максимальная'),
 (146, 'Русаков', 'Давид', 250, 2, 'Максимальная'),
 (147, 'Симонов', 'Семен', 100, 5, 'Минимальная'),
 (149, 'Вячеслав', 'Пахомов', 250, 3, 'Максимальная'),
 (203, 'Петрова', 'Екатерина', 250, 4, 'Максимальная'),
 (204, 'Петров', 'Вадим', 250, 2, 'Максимальная'),
 (265, 'Павлов', 'Андрей', 0, 3, 'Минимальная')]

## 7. Для каждого курса выведите фамилии самого старшего и самого младшего студентов. Пометьте строки списка словами 'младший' и 'старший', поместив их в дополнительном столбце.

In [81]:
s1 = student.alias("s1")
s2 = student.alias("s2")

subq1 = select(func.max(s2.c.birthday))
subq1 = subq1.group_by(s2.c.kurs)
subq1 = subq1.having(s2.c.kurs == s1.c.kurs).scalar_subquery()


subq2 = select(func.min(s2.c.birthday))
subq2 = subq2.group_by(s2.c.kurs)
subq2 = subq2.having(s2.c.kurs == s1.c.kurs).scalar_subquery()


stmt1 = select(s1.c.kurs, s1.c.surname, s1.c.name, s1.c.birthday, text("'Взрослейший' AS Category"))
stmt1 = stmt1.where( s1.c.birthday == subq2)

stmt2 = select(s1.c.kurs, s1.c.surname, s1.c.name, s1.c.birthday, text("'Младший' AS Category"))
stmt2 = stmt2.where( s1.c.birthday == subq1)

stmt = union(stmt1, stmt2).order_by(s1.c.kurs)
print(stmt)
result = conn.execute(stmt).fetchall()
print(len(result))
result

SELECT s1.kurs, s1.surname, s1.name, s1.birthday, 'Взрослейший' AS Category
FROM student AS s1
WHERE s1.birthday = (SELECT min(s2.birthday) AS min_1
FROM student AS s2 GROUP BY s2.kurs
HAVING s2.kurs = s1.kurs) UNION SELECT s1.kurs, s1.surname, s1.name, s1.birthday, 'Младший' AS Category
FROM student AS s1
WHERE s1.birthday = (SELECT max(s2.birthday) AS max_1
FROM student AS s2 GROUP BY s2.kurs
HAVING s2.kurs = s1.kurs) ORDER BY kurs
10

[(1, 'Васильева', 'Оксана', datetime.datetime(1994, 5, 14, 0, 0), 'Взрослейший'),
 (1, 'Ордуханян', 'Рафаэль', datetime.datetime(2003, 6, 1, 0, 0), 'Младший'),
 (2, 'Ковалев', 'Ефим', datetime.datetime(1995, 11, 28, 0, 0), 'Взрослейший'),
 (2, 'Некрасова', 'Вероника', datetime.datetime(2004, 8, 23, 0, 0), 'Младший'),
 (3, 'Семенова', 'Вероника', datetime.datetime(2003, 10, 4, 0, 0), 'Младший'),
 (3, 'Сорокина', 'Ирина', datetime.datetime(1993, 9, 28, 0, 0), 'Взрослейший'),
 (4, 'Журавлева', 'Вера', datetime.datetime(2003, 6, 14, 0, 0), 'Младший'),
 (4, 'Казакова', 'Мария', datetime.datetime(1994, 2, 18, 0, 0), 'Взрослейший'),
 (5, 'Ситников', 'Викентий', datetime.datetime(2003, 10, 5, 0, 0), 'Младший'),
 (5, 'Трофимов', 'Владислав', datetime.datetime(1995, 3, 24, 0, 0), 'Взрослейший')]

## 8. Напишите запрос для получения полного списка университетов вместе с количеством студентов, которые в них учатся. Для университетов, не имеющих студентов, поместите в список фразу ‘Студентов нет’. отсортируйте результат по убыванию числа студентов.

In [100]:
u1 = university.alias("u1")
u2 = university.alias("u2")

subq = select(func.count(student.c.student_id))
subq = subq.where(student.c.univ_id == u1.c.univ_id).scalar_subquery()


s1 = select(u1.c.univ_name, subq.label("Amount"), text("'Есть!' AS Category"))
s1 = s1.where(subq > 0)

s2 = select(u1.c.univ_name, subq, text("'Студентов нет' AS Category"))
s2 = s2.where(subq == 0)

stmt = union(s1, s2).order_by(text("Amount"))
print(stmt)
result = conn.execute(stmt).fetchall()
print(len(result))
result

SELECT u1.univ_name, (SELECT count(student.student_id) AS count_1
FROM student
WHERE student.univ_id = u1.univ_id) AS "Amount", 'Есть!' AS Category
FROM university AS u1
WHERE (SELECT count(student.student_id) AS count_1
FROM student
WHERE student.univ_id = u1.univ_id) > :param_1 UNION SELECT u1.univ_name, (SELECT count(student.student_id) AS count_1
FROM student
WHERE student.univ_id = u1.univ_id) AS anon_1, 'Студентов нет' AS Category
FROM university AS u1
WHERE (SELECT count(student.student_id) AS count_1
FROM student
WHERE student.univ_id = u1.univ_id) = :param_2 ORDER BY Amount
13

[('МФТИ', 0, 'Студентов нет'),
 ('ТГУ', 2, 'Есть!'),
 ('НГУ', 4, 'Есть!'),
 ('МГТУ им. Баумана', 5, 'Есть!'),
 ('УЛГУ', 5, 'Есть!'),
 ('КФУ', 6, 'Есть!'),
 ('ВГМА', 7, 'Есть!'),
 ('РГУ', 7, 'Есть!'),
 ('БГУ', 9, 'Есть!'),
 ('ФГБОУ "Политех"', 9, 'Есть!'),
 ('МГУ', 10, 'Есть!'),
 ('ФинУ', 10, 'Есть!'),
 ('ВГУ', 16, 'Есть!')]

## 9. Напишите запрос для получения полного списка университетов вместе с фамилиями преподавателей, в них работающих. Для университетов, не имеющих преподавателей, поместите в список фразу ‘Преподавателей нет’. результат должен содержать название университета, фамилию и имя преподавателя. отсортируйте результат по фамилии и имени преподавателя.

In [120]:
u1 = university.alias("u1")
u2 = university.alias("u2")

s1 = select(u1.c.univ_name, lecturer.c.surname, lecturer.c.name)
s1 = s1.select_from(u1).join(lecturer, lecturer.c.univ_id == u1.c.univ_id)

s2 = select( text("'Преподавателей нет' AS Category"), u1.c.univ_name,  text("' ' AS Category"))
s2 = s2.select_from(u1).join(lecturer, lecturer.c.univ_id == u1.c.univ_id, isouter=True)
s2 = s2.where(lecturer.c.lecturer_id == None)

stmt = union(s1, s2).order_by(lecturer.c.surname, lecturer.c.name)
print(stmt)
result = conn.execute(stmt).fetchall()
print(len(result))
result

SELECT u1.univ_name, lecturer.surname, lecturer.name
FROM university AS u1 JOIN lecturer ON lecturer.univ_id = u1.univ_id UNION SELECT 'Преподавателей нет' AS Category, u1.univ_name, ' ' AS Category
FROM university AS u1 LEFT OUTER JOIN lecturer ON lecturer.univ_id = u1.univ_id
WHERE lecturer.lecturer_id IS NULL ORDER BY surname, name
32

[('ВГУ', 'Алексеев', 'Елисей'),
 ('ВГМА', 'Артемьева', 'Майя'),
 ('Преподавателей нет', 'БГУ', ' '),
 ('РГУ', 'Беляков', 'Мефодий'),
 ('ТГУ', 'Беспалов', 'Юлиан'),
 ('ВГМА', 'Богданова', 'Оксана'),
 ('УЛГУ', 'Брагина', 'Нинель'),
 ('МГТУ им. Баумана', 'Волков', 'Михаил'),
 ('УЛГУ', 'Дмитриева', 'Оксана'),
 ('РГУ', 'Дорофеев', 'Прокофий'),
 ('УЛГУ', 'Елисеев', 'Виссарион'),
 ('ВГУ', 'Зайцева', 'Юлия'),
 ('ФГБОУ "Политех"', 'Зимин', 'Юлиан'),
 ('ВГУ', 'Зыкова', 'Оксана'),
 ('ВГУ', 'Колесников', 'Борис'),
 ('ВГМА', 'Крюкова', 'Людмила'),
 ('КФУ', 'Кудрявцева', 'Анна'),
 ('КФУ', 'Куликова', 'Ираида'),
 ('МГУ', 'Лагутин', 'Павел'),
 ('Преподавателей нет', 'МФТИ', ' '),
 ('ВГУ', 'Максимова', 'Иванна'),
 ('НГУ', 'Мамонтова', 'Акулина'),
 ('ВГУ', 'Николаев', 'Виктор'),
 ('ВГУ', 'Никонов', 'Иван'),
 ('ВГМА', 'Сафонов', 'Будимир'),
 ('ФГБОУ "Политех"', 'Сафонова', 'Лукия'),
 ('ВГМА', 'Ситникова', 'Светлана'),
 ('ВГУ', 'Сорокин', 'Андрей'),
 ('ФГБОУ "Политех"', 'Стрелков', 'Руслан'),
 ('МГУ', 'Струков', 'Николай'),
 ('ТГУ', 'Тихонов', 'Ладомир'),
 ('Преподавателей нет', 'ФинУ', ' ')]

## 10. Выведите полный список студентов вместе с оценками, полученными ими на экзаменах. Для студентов, не сдававших экзамены, в поле оценки поместите 0.

#### Ожидаемый результат

In [7]:
s2 = select(student.c.student_id, student.c.surname, student.c.name, func.coalesce(exam_marks.c.mark, 0))
s2 = s2.select_from(student).join(exam_marks, exam_marks.c.student_id == student.c.student_id, isouter=True)

result = conn.execute(s2).fetchall()
print(len(result))
result[:20]

100

[(1, 'Иванов', 'Иван', 1),
 (3, 'Петров', 'Петр', 0),
 (6, 'Сидоров', 'Вадим', 4),
 (10, 'Кузнецов', 'Борис', 5),
 (12, 'Зайцева', 'Ольга', 2),
 (12, 'Зайцева', 'Ольга', 5),
 (15, 'Ордуханян', 'Рафаэль', 2),
 (32, 'Котов', 'Павел', 4),
 (55, 'Белкин', 'Вадим', 0),
 (55, 'Белкин', 'Вадим', 5),
 (56, 'Дуб', 'Елизавета', 0),
 (57, 'Кудряшова', 'Вера', 0),
 (58, 'Журавлева', 'Вера', 0),
 (60, 'Рожкова', 'Пелагея', 0),
 (61, 'Соколова', 'Ия', 0),
 (62, 'Семенова', 'Вероника', 4),
 (63, 'Пак', 'Ирина', 3),
 (63, 'Пак', 'Ирина', 4),
 (63, 'Пак', 'Ирина', 5),
 (64, 'Жук', 'Оксана', 4)]

#### Выполнение с помощью union. Пришлось расширить количество столбцов, т.к. две строки терялись

In [19]:
em1 = exam_marks.alias("em1")
em2 = exam_marks.alias("em2")

subq = select(em2.c.exam_id)
subq = subq.where(em2.c.student_id == student.c.student_id)


s1 = select(student.c.surname, student.c.name, em1.c.exam_id, em1.c.mark)
s1 = s1.select_from(student).join(em1, em1.c.student_id == student.c.student_id)
s1 = s1.where(exists(subq))

s2 = select(student.c.surname, student.c.name, text("'Экзаменов не сдавал'"), 0)
s2 = s2.select_from(student).join(em1, em1.c.student_id == student.c.student_id, isouter=True)
s2 = s2.where(~exists(subq))

stmt = union(s1, s2)
print(stmt)
result = conn.execute(stmt).fetchall()
print(len(result))
result[:10]

SELECT student.surname, student.name, em1.exam_id, em1.mark
FROM student JOIN exam_marks AS em1 ON em1.student_id = student.student_id
WHERE EXISTS (SELECT em2.exam_id
FROM exam_marks AS em2
WHERE em2.student_id = student.student_id) UNION SELECT student.surname, student.name, 'Экзаменов не сдавал', 0
FROM student LEFT OUTER JOIN exam_marks AS em1 ON em1.student_id = student.student_id
WHERE NOT (EXISTS (SELECT em2.exam_id
FROM exam_marks AS em2
WHERE em2.student_id = student.student_id))
100

[('Агафонов', 'Василий', 'Экзаменов не сдавал', 0),
 ('Аксенов', 'Валерий', 'Экзаменов не сдавал', 0),
 ('Антонов', 'Анатолий', 22, 3),
 ('Архипов', 'Андрей', 'Экзаменов не сдавал', 0),
 ('Афанасьева', 'Анжелика', 7, 1),
 ('Баранов', 'Александр', 'Экзаменов не сдавал', 0),
 ('Белкин', 'Вадим', 75, 5),
 ('Белкин', 'Вадим', 639, None),
 ('Бирюков', 'Герасим', 'Экзаменов не сдавал', 0),
 ('Бирюков', 'Мартин', 'Экзаменов не сдавал', 0)]

### У Белкина Вадима есть экзамен, по которому у него оценка None, но есть данные о сдаче экзамена. Будем считать, что он сдавал, но его работа не проверена

#### В задании 2 я переделал запрос, чтобы количество студентов было равно 90